Revit 2024 API
ExternalServices.BuiltInExternalServices.ModifyConnectionRangesService Property
 The external service to view and modify structural connection ranges of applicability.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static ExternalServiceId ModifyConnectionRangesService { get; }
Visual Basic
Public Shared ReadOnly Property ModifyConnectionRangesService As ExternalServiceId
	Get
Visual C++
public:
static property ExternalServiceId^ ModifyConnectionRangesService {
	ExternalServiceId^ get ();
}
See Also
ExternalServices.BuiltInExternalServices Class
Autodesk.Revit.DB.ExternalService Namespace